Tekla Open API Reference for Tekla Structures 2025
ViewMarkTagsAttributes Properties
The View.ViewMarkTagsAttributes type exposes the following members.
Properties
Name | Description
TagA1
 The tag A1 of a mark.
TagA2
 The tag A2 of a mark.
TagA3
 The tag A3 of a mark.
TagA4
 The tag A4 of a mark.
TagA5
 The tag A5 of a mark.
Top
See Also
Reference
View.ViewMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace